events_backend/app/controllers/events_controller.rb

    def show
        event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def index
        events = Event.all
---
SELECT "events".* FROM "events"

    def create
        eventNew = Event.new(name: params[:name], user_id: params[:user_id], date: params[:date], image: params[:image_url])
        if eventNew.save
---
INSERT INTO "events" ("name", "date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "That party"], ["date", "2019-04-23 14:52:01.113000"], ["user_id", 3], ["created_at", "2019-04-24 11:33:10.000531"], ["updated_at", "2019-04-24 11:33:10.000531"]]

    def destroy
        event_del = Event.find_by(id: params[:id])

        event_del.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 4]]